---
kind: other
id: Methods.T:Autodesk.Revit.DB.WallFoundationType
source: html/72a75b28-d20c-2b56-7c15-87e354956f74.htm
---
# WallFoundationType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.